#+TITLE: My Doom Emacs config
#+EMAIL: gtrunsec@hardenedlinux.org
#+DATE:  25 October 2019
#+AUTHOR: GTrunSec
#+KEYWORDS: Emacs Profile Doom-Emacs
#+OPTIONS:   H:3 num:t toc:t \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t pri:t
#+SETUPFILE: ~/Documents/org-notes/setup/hugo.local
#+SETUPFILE: ~/Documents/my-blog/public/theme/org-html-themes/setup/theme-readtheorg.setup
#+hugo_publishdate: `org-time-stamp-rounding-minutes`
#+hugo_auto_set_lastmod: t
#+HUGO_categories: profile Doom-Emacs
#+HUGO_tags: Emacs Config
#+PROPERTY: header-args :tangle "~/.emacs.d/init.el"

- [[https://github.com/hlissner/doom-emacs/blob/develop/docs/getting_started.org][doom-emacs/getting_started.org at develop · hlissner/doom-emacs]]
*** highlight
#+begin_src emacs-lisp :tangle "./modules/private/my-org/config.el"
  ;; (require 'ox)
  ;; (defun my-html-mark-tag (text backend info)
  ;;   "Transcode :blah: into <mark>blah</mark> in body text."
  ;;   (when (org-export-derived-backend-p backend 'html)
  ;;     (let ((text (replace-regexp-in-string "[^\\w]\\(:\\)[^\n\t\r]+\\(:\\)[^\\w]" "<mark>"  text nil nil 1 nil)))
  ;;       (replace-regexp-in-string "[^\\w]\\(<mark>\\)[^\n\t\r]+\\(:\\)[^\\w]" "</mark>" text nil nil 2 nil))))

  ;; (add-to-list 'org-export-filter-plain-text-functions 'my-html-mark-tag)

  ;; (defun my-html-mark-tag (text backend info)
  ;;   "Transcode :blah: into <mark>blah</mark> in body text."
  ;;   (when (org-export-derived-backend-p backend 'html)
  ;;     (let ((text (replace-regexp-in-string "[^\\w]\\(:\\)[^\n\t\r]+\\(:\\)[^\\w]" "<mark>"  text nil nil 1 nil)))
  ;;       (replace-regexp-in-string "[^\\w]\\(<mark>\\)[^\n\t\r]+\\(:\\)[^\\w]" "</mark>" text nil nil 2 nil))))

  ;; (add-to-list 'org-export-filter-plain-text-functions 'my-html-mark-tag)
#+end_src

#+RESULTS:
| my-html-mark-tag |

** company-backend
#+begin_src emacs-lisp :tangle "config.el"
(set-company-backend! '(nix-mode)
  '(:separate company-nixos-options
              company-tabnine
              company-files
              company-yasnippet
              ))

;;  (set-company-backend! 'sh-mode nil) ; unsets backends for sh-mode
(set-company-backend! '(org-mode)
  '(:separate company-english-helper-search
              company-tabnine
              company-files
              company-yasnippet
              ))
(set-company-backend! '(c-mode
                        c++-mode
                        ess-mode
                        haskell-mode
                        ;;emacs-lisp-mode
                        lisp-mode
                        sh-mode
                        php-mode
                        python-mode
                        go-mode
                        ruby-mode
                        rust-mode
                        js-mode
                        css-mode
                        web-mode
                        )
  '(:separate company-tabnine
              company-files
              company-yasnippet))

(setq +lsp-company-backend '(company-lsp :with company-tabnine :separate))
#+end_src

#+RESULTS:
| company-lsp | :with | company-tabnine | :separate |

** html file to ox-hugo
#+begin_src emacs-lisp :tangle "config.el"
  ;; (require 'ox)
  ;; (defun my-html-ox-hugo (text backend info)
  ;;   "Transcode :blah: into <mark>blah</mark> in body text."
  ;;   (when (org-export-derived-backend-p backend 'html)
  ;;     (let ((text (replace-regexp-in-string "file" "/ox-hugo/"  text nil nil 1 nil))))))

  ;; (add-to-list 'org-export-filter-plain-text-functions 'my-html-ox-hugo)
#+end_src

#+RESULTS:
| my-html-ox-hugo |

